Dennis-van-Gils/DvG_Arduino_lock-in_amp/source_Atmel_Studio/project_LIA_SAMD21/LIA_SAMD21/main.c
/*
Arduino lock-in amplifier (LIA)
Phase-sensitive detector

Dennis van Gils

TODO: implement https://github.com/mpflaga/Arduino-MemoryFree
*/

#include <atmel_start.h>
#include <math.h>
#include <hpl_dma.h>
#include <stdio.h>
#include <stdlib.h>
#include <hpl_tcc_config.h>
#include <string.h>
#include <utils.h>
#include "DvG_serial_command_listener.h"

#define FIRMWARE_VERSION "ALIA v1.0.0 MICROCHIPSTUDIO"
#define VARIANT_MCK (48000000ul)   // Master clock frequency

// OBSERVATION: single-ended has half the noise compared to differential
#define ADC_DIFFERENTIAL 0  // Leave at 0, differential mode is not implemented

// Microcontroller unit (mcu)
#if defined __SAMD21G18A__
#  define MCU_MODEL "SAMD21G18A"
#elif defined __SAMD21E18A__
#  define MCU_MODEL "SAMD21E18A"
#elif defined __SAMD51P20A__
#  define MCU_MODEL "SAMD51P20A"
#elif defined __SAMD51J19A__
#  define MCU_MODEL "SAMD51J19A"
#elif defined __SAMD51G19A__
#  define MCU_MODEL "SAMD51G19A"
#endif

// Preprocessor trick to ensure enums and strings are in sync, so one can write
// 'WAVEFORM_STRING[Cosine]' to give the string 'Cosine'
#define FOREACH_WAVEFORM(WAVEFORM)                                             \
  WAVEFORM(Cosine)                                                             \
  WAVEFORM(Square)                                                             \
  WAVEFORM(Triangle)                                                           \
  WAVEFORM(END_WAVEFORM_ENUM)
#define GENERATE_ENUM(ENUM) ENUM,
#define GENERATE_STRING(STRING) #STRING,

enum WAVEFORM_ENUM { FOREACH_WAVEFORM(GENERATE_ENUM) };
static const char *WAVEFORM_STRING[] = {FOREACH_WAVEFORM(GENERATE_STRING)};

// Others
volatile bool is_running = false; // Is the lock-in amplifier running?
volatile bool trigger_reset_time = false;
volatile bool is_serial_txc = false; // Is serial data sent out?
volatile bool is_serial_rxc = false; // Is serial data received?
volatile uint32_t millis = 0;        // Updated by SysTick, once every 1 ms
char mcu_uid[33]; // Serial number



/*------------------------------------------------------------------------------
  Waveform look-up table (LUT)
------------------------------------------------------------------------------*/

// Output reference signal parameters
enum WAVEFORM_ENUM ref_waveform = Cosine;
double ref_freq;  // [Hz] Obtained frequency of reference signal
double ref_offs;  // [V]  Obtained voltage offset of reference signal
double ref_ampl;  // [V]  Voltage amplitude reference signal

// Look-up table (LUT) for fast DAC
#define MIN_N_LUT 20     // Min. allowed number of samples for one full period
#define MAX_N_LUT 1000   // Max. allowed number of samples for one full period
uint16_t LUT_wave[MAX_N_LUT] = {0}; // Look-up table allocation
uint16_t N_LUT;          // Current number of samples for one full period
bool is_LUT_dirty = false; // Does the LUT have to be updated with new settings?

// Analog port
#define A_REF 3.300    // [V] Analog voltage reference Arduino
#define ADC_INPUT_BITS 12
#if defined(_SAMD21_)
  #define DAC_OUTPUT_BITS 10
#elif defined(_SAMD51_)
  #define DAC_OUTPUT_BITS 12
#endif
#define MAX_DAC_OUTPUT_BITVAL ((uint16_t) (pow(2, DAC_OUTPUT_BITS) - 1))

/*------------------------------------------------------------------------------
  TIMER_0
------------------------------------------------------------------------------*/

/* Channel CC[0] of timer TCC0 is set to match mode and will trigger output
events periodically at a fixed sample rate (say 20 kHz). It is the source that
triggers and synchronizes the DAC and ADC conversions.

The DAC buffer is N_LUT samples long, corresponding to a full period of
the output waveform. The frequency of the output waveform is hence changed by
increasing or decreasing N_LUT.

The ADC buffer is BLOCK_SIZE samples long and is independent of the DAC.
Whenever the ADC buffer is completely filled up, it is automatically sent out
over the serial port by the direct memory access controller (DMAC). A double
buffer is employed, called TX_buffer_A and TX_buffer_B.

A digital trigger signal that is in sync with every full period of the output
waveform is made available on a digital output pin, useful for connecting up
an oscilloscope.
*/
#define TCC0_PER_CORRECTION 1  // Might be something wrong in the ASF4 library?

const double SAMPLING_PERIOD_us =
  (CONF_TCC0_PER + TCC0_PER_CORRECTION) *
  (1000000. / (CONF_GCLK_TCC0_FREQUENCY / CONF_TCC0_PRESCALE));

const double SAMPLING_RATE_Hz =
  (double) CONF_GCLK_TCC0_FREQUENCY / CONF_TCC0_PRESCALE /
  (CONF_TCC0_PER + TCC0_PER_CORRECTION);

/*------------------------------------------------------------------------------
  Double buffer: TX_buffer_A & TX_buffer_B
------------------------------------------------------------------------------*/

// The number of samples to acquire by the ADC and to subsequently send out
// over serial as a single block of data
#define BLOCK_SIZE 2000    // [# samples], where 1 sample takes up 16 bits

// Serial transmission sentinels: start and end of message
const char SOM[] = {0x00, 0x80, 0x00, 0x80, 0x00, 0x80, 0x00, 0x80, 0x00, 0x80};
const char EOM[] = {0xff, 0x7f, 0x00, 0x00, 0xff, 0x7f, 0x00, 0x00, 0xff, 0x7f};

/*
  A full transmit buffer will contain a single block of data:

  [
  SOM,                                              {10 bytes}
  (uint32_t) number of block being send             { 4 bytes}
  (uint32_t) millis timestamp at start of block     { 4 bytes}
  (uint16_t) micros part of timestamp               { 2 bytes}
  (uint16_t) `LUT_wave` index at start of block     { 2 bytes}
  BLOCK_SIZE x (uint16_t) ADC readings `sig_I`      {BLOCK_SIZE * 2 bytes}
  EOM                                               {10 bytes}
  ]
*/
#define N_BYTES_SOM     (sizeof(SOM))
#define N_BYTES_COUNTER (4)
#define N_BYTES_MILLIS  (4)
#define N_BYTES_MICROS  (2)
#define N_BYTES_PHASE   (2)
#define N_BYTES_SIG_I   (BLOCK_SIZE * 2)
#define N_BYTES_EOM     (sizeof(EOM))

#define N_BYTES_TX_BUFFER (N_BYTES_SOM + \
                           N_BYTES_COUNTER + \
                           N_BYTES_MILLIS + \
                           N_BYTES_MICROS + \
                           N_BYTES_PHASE + \
                           N_BYTES_SIG_I + \
                           N_BYTES_EOM)

static uint8_t TX_buffer_A[N_BYTES_TX_BUFFER] = {0};
static uint8_t TX_buffer_B[N_BYTES_TX_BUFFER] = {0};
volatile uint32_t TX_buffer_counter = 0;
volatile bool using_TX_buffer_A = true; // When false: Using TX_buffer_B

#define TX_BUFFER_OFFSET_COUNTER (N_BYTES_SOM)
#define TX_BUFFER_OFFSET_MILLIS  (TX_BUFFER_OFFSET_COUNTER + N_BYTES_COUNTER)
#define TX_BUFFER_OFFSET_MICROS  (TX_BUFFER_OFFSET_MILLIS  + N_BYTES_MILLIS)
#define TX_BUFFER_OFFSET_PHASE   (TX_BUFFER_OFFSET_MICROS  + N_BYTES_MICROS)
#define TX_BUFFER_OFFSET_SIG_I   (TX_BUFFER_OFFSET_PHASE   + N_BYTES_PHASE)



/*------------------------------------------------------------------------------
  Serial
------------------------------------------------------------------------------*/

// Outgoing serial string
#define MAXLEN_STR_BUFFER 100
char str_buffer[MAXLEN_STR_BUFFER];
char usb_buffer[MAXLEN_STR_BUFFER];
struct io_descriptor* io;

