Dennis-van-Gils/DvG_Arduino_lock-in_amp/source_Atmel_Studio/project_LIA_SAMD21/LIA_SAMD21/main.c
/*
void memset32(void *dest, uint32_t value, uintptr_t size) {
  uintptr_t i;
  for(i = 0; i < (size & (~3)); i+=4) {
    memcpy( ((char*)dest) + i, &value, 4);
  }
  for( ; i < size; i++) {
    ((char *) dest)[i] = ((char *) &value)[i&3];
  }
}
*/

/*
// Calculate free SRAM during run-time (32 KB available on SAMD21)
size_t get_free_RAM() {
  char stack_dummy = 0;
  return (&stack_dummy - sbrk(0));
}
*/

/*------------------------------------------------------------------------------
  Time keeping
------------------------------------------------------------------------------*/

/* We use SYSTICK for time stamping at a microsecond resolution. The SYSTICK
interrupt service routine is set to fire every 1 millisecond. Anything faster
than this will result in a too heavy a burden on system resources and will
deteriorate the timing accuracy. The microsecond part can be retrieved when
needed, see `get_systick_timestamp()`.

Note:
  The millis counter will roll over after 49.7 days.
*/

void SysTick_Handler(void) {
  millis++;
}

void get_systick_timestamp(uint32_t *stamp_millis,
                           uint16_t *stamp_micros_part) {
  /* Adapted from:
  https://github.com/arduino/ArduinoCore-samd/blob/master/cores/arduino/delay.c
  */
  uint32_t ticks, ticks2;
  uint32_t pend, pend2;
  uint32_t count, count2;

  ticks2 = SysTick->VAL;
  pend2  = !!(SCB->ICSR & SCB_ICSR_PENDSTSET_Msk)  ;
  count2 = millis ;

  do {
    ticks  = ticks2;
    pend   = pend2;
    count  = count2;
    ticks2 = SysTick->VAL;
    pend2  = !!(SCB->ICSR & SCB_ICSR_PENDSTSET_Msk)  ;
    count2 = millis;
  } while ((pend != pend2) || (count != count2) || (ticks < ticks2));

  (*stamp_millis) = count2;
  if (pend) {(*stamp_millis)++;}
  (*stamp_micros_part) =
    (((SysTick->LOAD - ticks) * (1048576 / (VARIANT_MCK/1000000)) ) >> 20);
}



void stamp_TX_buffer(uint8_t *TX_buffer) {
  /* Write timestamp and `phase`-stamp of the first ADC sample of the block
  that is about to be sent out over the serial port. We need to know which
  phase angle was output on the DAC, that corresponds in time to the first ADC
  sample of the `TX_buffer`. This is the essence of a phase-sensitive detector,
  which is the building block of a lock-in amplifier.
  */

  static uint32_t startup_millis = 0; // Time when lock-in amp got turned on
  static uint16_t startup_micros = 0; // Time when lock-in amp got turned on
  uint32_t millis_copy;
  uint16_t micros_part;
  uint16_t idx_phase;

  get_systick_timestamp(&millis_copy, &micros_part);

  // Modulo takes more cycles when time increases.
  // Is max 164 clock cycles when (2^24 % N_LUT).
  // The ADC readings lag behind the DAC output by 1 sample
  #define SAMPLE_OFFSET_ADC_DAC 1   // Must be >= 0
  idx_phase = (TIMER_0.time + N_LUT + SAMPLE_OFFSET_ADC_DAC) % N_LUT;


  if (trigger_reset_time) {
    trigger_reset_time = false;
    startup_millis = millis_copy;
    startup_micros = micros_part;
  }

  TX_buffer_counter++;
  millis_copy -= startup_millis;
  if (micros_part >= startup_micros) {
    micros_part -= startup_micros;
  } else {
    micros_part = micros_part + 1000 - startup_micros;
    millis_copy -= 1;
  }
  TX_buffer[TX_BUFFER_OFFSET_COUNTER    ] = TX_buffer_counter;
  TX_buffer[TX_BUFFER_OFFSET_COUNTER + 1] = TX_buffer_counter >> 8;
  TX_buffer[TX_BUFFER_OFFSET_COUNTER + 2] = TX_buffer_counter >> 16;
  TX_buffer[TX_BUFFER_OFFSET_COUNTER + 3] = TX_buffer_counter >> 24;
  TX_buffer[TX_BUFFER_OFFSET_MILLIS     ] = millis_copy;
  TX_buffer[TX_BUFFER_OFFSET_MILLIS  + 1] = millis_copy >> 8;
  TX_buffer[TX_BUFFER_OFFSET_MILLIS  + 2] = millis_copy >> 16;
  TX_buffer[TX_BUFFER_OFFSET_MILLIS  + 3] = millis_copy >> 24;
  TX_buffer[TX_BUFFER_OFFSET_MICROS     ] = micros_part;
  TX_buffer[TX_BUFFER_OFFSET_MICROS  + 1] = micros_part >> 8;
  TX_buffer[TX_BUFFER_OFFSET_PHASE      ] = idx_phase;
  TX_buffer[TX_BUFFER_OFFSET_PHASE   + 1] = idx_phase >> 8;
}



/*------------------------------------------------------------------------------
  USB print
------------------------------------------------------------------------------*/
/*
void usb_print(const char *str_msg) {
  sprintf(usb_buffer, "%s", str_msg);
  cdcdf_acm_write((uint8_t *) usb_buffer, strlen(usb_buffer));
}
*/


/*------------------------------------------------------------------------------
  USART
------------------------------------------------------------------------------*/

void io_write_blocking(uint8_t *data, uint16_t len) {
  is_serial_txc = false;
  io_write(io, data, len);
  while (!is_serial_txc) {}
}

void io_print(const char *str_msg) {
  // Blocking
  is_serial_txc = false;
  io_write(io, (uint8_t *) str_msg, strlen(str_msg));
  while (!is_serial_txc) {}
}

void io_print_timestamp(void) {
  // Report time in microseconds
  static char buf[16];
  uint32_t millis_copy;
  uint16_t micros_part;

  get_systick_timestamp(&millis_copy, &micros_part);
  sprintf(buf, "%lu.%03u\n", millis_copy, micros_part);
  io_print(buf);
}

static void cb_USART_txc(const struct usart_async_descriptor *const io_descr) {
  is_serial_txc = true;
}

static void cb_USART_rxc(const struct usart_async_descriptor *const io_descr) {
  is_serial_rxc = true;
}

/*
static void cb_USART_err(const struct usart_async_descriptor *const io_descr) {
  usb_print("USART ERROR\n");
}
*/



/*------------------------------------------------------------------------------
  get_mcu_uid
------------------------------------------------------------------------------*/

void get_mcu_uid(char mcu_uid_out[33]) {
  /* Return the 128-bit unique identifier (uid) of the microcontroller unit
  (mcu) as a hex string. Aka, the serial number.
  */
  uint8_t raw_uid[16]; // uid as byte array

// SAMD21 from section 9.3.3 of the datasheet
#ifdef _SAMD21_
#  define SERIAL_NUMBER_WORD_0 *(volatile uint32_t *)(0x0080A00C)
#  define SERIAL_NUMBER_WORD_1 *(volatile uint32_t *)(0x0080A040)
#  define SERIAL_NUMBER_WORD_2 *(volatile uint32_t *)(0x0080A044)
#  define SERIAL_NUMBER_WORD_3 *(volatile uint32_t *)(0x0080A048)
#endif
// SAMD51 from section 9.6 of the datasheet
#ifdef _SAMD51_
#  define SERIAL_NUMBER_WORD_0 *(volatile uint32_t *)(0x008061FC)
#  define SERIAL_NUMBER_WORD_1 *(volatile uint32_t *)(0x00806010)
#  define SERIAL_NUMBER_WORD_2 *(volatile uint32_t *)(0x00806014)
#  define SERIAL_NUMBER_WORD_3 *(volatile uint32_t *)(0x00806018)
#endif

