Dennis-van-Gils/DvG_Arduino_lock-in_amp/source_Atmel_Studio/project_LIA_SAMD21/LIA_SAMD21/main.c
  uint32_t pdw_uid[4];
  pdw_uid[0] = SERIAL_NUMBER_WORD_0;
  pdw_uid[1] = SERIAL_NUMBER_WORD_1;
  pdw_uid[2] = SERIAL_NUMBER_WORD_2;
  pdw_uid[3] = SERIAL_NUMBER_WORD_3;

  for (int i = 0; i < 4; i++) {
    raw_uid[i * 4 + 0] = (uint8_t)(pdw_uid[i] >> 24);
    raw_uid[i * 4 + 1] = (uint8_t)(pdw_uid[i] >> 16);
    raw_uid[i * 4 + 2] = (uint8_t)(pdw_uid[i] >> 8);
    raw_uid[i * 4 + 3] = (uint8_t)(pdw_uid[i] >> 0);
  }

  for (int j = 0; j < 16; j++) {
    sprintf(&mcu_uid_out[2 * j], "%02X", raw_uid[j]);
  }
  mcu_uid_out[32] = 0;
}



/*------------------------------------------------------------------------------
  Waveform look-up table (LUT)
------------------------------------------------------------------------------*/
/*
In order to drive the DAC at high sampling speeds, we compute the reference
waveform in advance by a look-up table (LUT). The LUT will contain the samples
for one complete period of the waveform. The LUT is statically allocated and can
fit up to 'MAX_N_LUT' number of samples.
Because the 'SAMPLING_PERIOD_us' is fixed and the LUT can only have an integer
number of samples 'N_LUT', the possible wave frequencies are discrete.
That means that there is a distinction between the wanted frequency and the
obtained frequency 'ref_freq'.
*/

void parse_freq(const char const *str_value) {
  ref_freq = atof(str_value);
  N_LUT = (uint16_t) round(SAMPLING_RATE_Hz / ref_freq);
  N_LUT = max(N_LUT, MIN_N_LUT);
  N_LUT = min(N_LUT, MAX_N_LUT);
  ref_freq = SAMPLING_RATE_Hz / N_LUT;
}

void parse_offs(const char const *str_value) {
  ref_offs = atof(str_value);
  ref_offs = max(ref_offs, 0.0);
  ref_offs = min(ref_offs, A_REF);
}

void parse_ampl(const char const *str_value) {
  ref_ampl = atof(str_value);
  ref_ampl = max(ref_ampl, 0.0);
  ref_ampl = min(ref_ampl, A_REF);
}

void compute_LUT(uint16_t *LUT_array) {
  double norm_offs = ref_offs / A_REF; // Normalized
  double norm_ampl = ref_ampl / A_REF; // Normalized
  double wave;

  // Generate normalized waveform periods in the range [0, 1]
  for (int16_t i = 0; i < N_LUT; i++) {
    float j = i % N_LUT;

    switch (ref_waveform) {
      default:
      case Cosine:
        // N_LUT even: extrema [ 0, 1]
        // N_LUT odd : extrema [>0, 1]
        wave = .5 * (1 + cos(M_TWOPI * j / N_LUT));
        break;

      case Square:
        // Extrema guaranteed  [ 0, 1]
        wave = round(fmod(1.75 * N_LUT - j, N_LUT) / (N_LUT - 1));
        break;

      case Triangle:
        // N_LUT even: extrema [ 0, 1]
        // N_LUT odd : extrema [>0, 1]
        wave = 2 * fabs(j / N_LUT - .5);
        break;
    }

    wave = (norm_offs - norm_ampl) + 2 * norm_ampl * wave;
    wave = max(wave, 0.0);
    wave = min(wave, 1.0);
    LUT_array[i] = (uint16_t)round(MAX_DAC_OUTPUT_BITVAL * wave);
  }

  is_LUT_dirty = false;
}



/*------------------------------------------------------------------------------
  DAC
------------------------------------------------------------------------------*/

static void cb_DAC_0_conversion_done(struct dac_async_descriptor *const descr,
                                     const uint8_t ch) {
  // Copy a new full period of the waveform into the DAC output buffer
  if (is_running) {
    gpio_set_pin_level(PIN_D0__TRIG_OUT, true);
    dac_async_write(descr, 0, LUT_wave, N_LUT);
    gpio_set_pin_level(PIN_D0__TRIG_OUT, false);
  }
}



/*------------------------------------------------------------------------------
  ADC
------------------------------------------------------------------------------*/

/*
static void cb_ADC_0_error(const struct adc_dma_descriptor *const descr) {
  usb_print("ADC_0 ERROR\n");
}
*/

static void cb_ADC_0_complete(const struct adc_dma_descriptor *const descr) {
  /*
  if (ADC->INTFLAG.bit.OVERRUN == 1) {
    usb_print("OVERRUN\n");
    ADC->INTENSET.bit.OVERRUN = 1;
  }
  */

  if (is_running) {
    if (using_TX_buffer_A) {
      if (TX_buffer_counter == 0) {
        // Start-up routine. Discard the first read ADC samples.
      } else {
        // Trigger DMA channel 1: Send out TX_buffer_A
        _dma_enable_transaction(1, false);
      }

      // Trigger reading a new block of ADC samples into TX_buffer_B
      adc_dma_read(&ADC_0, &(TX_buffer_B[TX_BUFFER_OFFSET_SIG_I]), BLOCK_SIZE);
      stamp_TX_buffer(TX_buffer_B);
    } else {
      // Trigger DMA channel 2: Send out TX_buffer_B
      _dma_enable_transaction(2, false);

      // Trigger reading a new block of ADC samples into TX_buffer_A
      adc_dma_read(&ADC_0, &(TX_buffer_A[TX_BUFFER_OFFSET_SIG_I]), BLOCK_SIZE);
      stamp_TX_buffer(TX_buffer_A);
    }
    // Switch buffer around
    using_TX_buffer_A = !using_TX_buffer_A;
  }

  //io_print_timestamp();
}



/*------------------------------------------------------------------------------
  LIA
------------------------------------------------------------------------------*/

void init_LIA(void) {
  // DAC
  dac_async_register_callback(&DAC_0, DAC_ASYNC_CONVERSION_DONE_CB,
                              cb_DAC_0_conversion_done);
  dac_async_enable_channel(&DAC_0, 0);

  // ADC
  adc_dma_register_callback(&ADC_0, ADC_DMA_COMPLETE_CB, cb_ADC_0_complete);
  //adc_dma_register_callback(&ADC_0, ADC_DMA_ERROR_CB, cb_ADC_0_error);

  timer_start(&TIMER_0);
}

void start_LIA(void) {
  timer_stop(&TIMER_0);
  TIMER_0.time = 0;

  // DAC
  dac_async_write(&DAC_0, 0, LUT_wave, N_LUT);

  // ADC
  // Because the very first sample read by the ADC is invalid and should be
  // discarded, we only read 2 samples into the ADC buffer (an even length
  // is required). This buffer will be discarded and will not be sent out over
  // serial. This is a start-up routine.
  adc_dma_deinit(&ADC_0);
  adc_dma_init(&ADC_0, ADC);
  adc_dma_read(&ADC_0, &(TX_buffer_A[TX_BUFFER_OFFSET_SIG_I]), 2); // Even length required, not odd
  adc_dma_enable_channel(&ADC_0, 0);

  TX_buffer_counter = 0;
  using_TX_buffer_A = true;

