Dennis-van-Gils/DvG_Arduino_lock-in_amp/source_Atmel_Studio/project_LIA_SAMD21/LIA_SAMD21/main.c
  // Set TRIG_OUT to LOW
  gpio_set_pin_level(PIN_D0__TRIG_OUT, false);

  is_running = true;
  timer_start(&TIMER_0);
}



/*------------------------------------------------------------------------------
  Direct memory access controller (DMAC)
------------------------------------------------------------------------------*/

/*
// Snippet for the transfer done interrupt callback.
static void cb_DMA_1_transfer_done(struct _dma_resource *const resource) {
  // Clear transfer complete flag
  DMAC->CHID.bit.ID = 1;
  DMAC->CHINTENSET.bit.TCMPL = 1;

  //sprintf(str_buffer, "%8lu DMA_1_txc\n", millis);
  //usb_print(str_buffer);
}
*/

void configure_DMA_1(void) {
  // Will send out TX_buffer_A over serial
  _dma_set_source_address(1, (void *) TX_buffer_A);
  _dma_set_destination_address(
    1, (void *) &(((Sercom *)(USART_0.device.hw))->USART.DATA.reg));
  _dma_set_data_amount(1, (uint32_t) N_BYTES_TX_BUFFER);

  /*
  // Snippet to enable the transfer done interrupt callback. This can be
  // useful for debugging, but do not leave on for proper operation as it
  // seems to mess with tight timing and screws the event order around,
  // somehow.
  struct _dma_resource *dma_res;

  // Get DMA channel 1 resource to set the application callback
  _dma_get_channel_resource(&dma_res, 1);

  // Set application callback to handle the DMA channel 1 transfer done
  dma_res->dma_cb.transfer_done = cb_DMA_1_transfer_done;

  // Enable DMA channel 1 transfer complete interrupt
  _dma_set_irq_state(1, DMA_TRANSFER_COMPLETE_CB, true);
  */
}

void configure_DMA_2(void) {
  // Will send out TX_buffer_B over serial
  _dma_set_source_address(2, (void *) TX_buffer_B);
  _dma_set_destination_address(
    2, (void *) &(((Sercom *)(USART_0.device.hw))->USART.DATA.reg));
  _dma_set_data_amount(2, (uint32_t) N_BYTES_TX_BUFFER);
}



/*------------------------------------------------------------------------------
  main
------------------------------------------------------------------------------*/

int main(void) {
  NVIC_SetPriority(TCC0_IRQn   , 0);
  NVIC_SetPriority(DAC_IRQn    , 1);
  NVIC_SetPriority(ADC_IRQn    , 1);
  NVIC_SetPriority(SERCOM5_IRQn, 2);
  NVIC_SetPriority(SysTick_IRQn, 3);
  atmel_start_init();

  // Microcontroller unit (MCU) unique identifier (uid) number
  get_mcu_uid(mcu_uid);

  // USART
  usart_async_get_io_descriptor(&USART_0, &io);
  usart_async_register_callback(&USART_0, USART_ASYNC_TXC_CB, cb_USART_txc);
  usart_async_register_callback(&USART_0, USART_ASYNC_RXC_CB, cb_USART_rxc);
  //usart_async_register_callback(&USART_0, USART_ASYNC_ERROR_CB, cb_USART_err);
  usart_async_enable(&USART_0);

  DvG_scl scl_1;
  scl_configure(&scl_1, io);

  // Copy SOM and EOM to the transmit buffer TX_buffer
  memcpy(TX_buffer_A, SOM, 10);
  memcpy(TX_buffer_B, SOM, 10);
  memcpy(&TX_buffer_A[N_BYTES_TX_BUFFER - 10], EOM, 10);
  memcpy(&TX_buffer_B[N_BYTES_TX_BUFFER - 10], EOM, 10);

  // Millis and micros timer
  //SysTick_Config(SystemCoreClock / 1000);
  SysTick->LOAD = (uint32_t) (SystemCoreClock / 1000 - 1UL);
  SysTick->VAL  = 0UL;
  SysTick->CTRL =
		SysTick_CTRL_CLKSOURCE_Msk |
		SysTick_CTRL_TICKINT_Msk |
		SysTick_CTRL_ENABLE_Msk;

  // LUT
  parse_freq("250.0"); // [Hz] Wanted startup frequency
  parse_offs("1.7");   // [V]  Wanted startup offset
  parse_ampl("1.414"); // [V]  Wanted startup amplitude
  compute_LUT(LUT_wave);

  // Will send out TX_buffer over SERCOM when triggered
  configure_DMA_1();
  configure_DMA_2();

  // Init DAC and ADC
  init_LIA();

  char *str_cmd;  // Incoming serial command string
  bool toggle = false;
  uint32_t prev_millis = millis;

  while (1) {
    if (millis - prev_millis >= 250) {
      prev_millis = millis;
      gpio_set_pin_level(PIN_D13__LED, toggle);
      toggle = !toggle;
    }

    // Process commands on the data channel
    if (is_serial_rxc) {
      is_serial_rxc = false;

      if (scl_available(&scl_1)) {

        if (is_running) { // Atomic read, `noInterrupts()` not required here

          /*--------------
            Running
          ----------------
            Any command received while running will switch the lock-in amp off.
            The command string will not be checked in advance, because this
            causes a lot of overhead, during which time the Arduino's serial-out
            buffer could potentially flood the serial-in buffer at the PC side.
            This will happen when the PC is not reading (and depleting) the
            in-buffer as fast as possible because it is now waiting for the 'off'
            reply to occur.
          */

          is_running = false;

          // Disable DAC output
          uint16_t DAC_OUTPUT_OFF[1] = {0};
          dac_async_write(&DAC_0, 0, DAC_OUTPUT_OFF, 1);
          gpio_set_pin_level(PIN_D0__TRIG_OUT, false);

          // Cancel all active DMA transactions
          CRITICAL_SECTION_ENTER();
          DMAC->CHID.reg = DMAC_CHID_ID(0);   // ADC
          DMAC->CHCTRLA.reg = 0;
          DMAC->CHID.reg = DMAC_CHID_ID(1);   // SERCOM TX_buffer_A
          DMAC->CHCTRLA.reg = 0;
          DMAC->CHID.reg = DMAC_CHID_ID(2);   // SERCOM TX_buffer_B
          DMAC->CHCTRLA.reg = 0;
          CRITICAL_SECTION_LEAVE();

          // Flush out any binary buffer data scheduled for sending,
          // potentially flooding the receiving buffer at the PC side
          // if 'is_running' was not switched to false fast enough.
          while (!usart_async_is_tx_empty(&USART_0));

          // Confirm at the PC side that the lock-in amp is off and is
          // no longer sending binary data. The 'off' message might
          // still be preceded with some left-over binary data when
          // being read at the PC side.
          //io_write(io, (uint8_t *) "\noff\n", 5);  // non-blocking
          io_print("\noff\n"); // blocking

