Dennis-van-Gils/DvG_Arduino_lock-in_amp/source_Atmel_Studio/project_LIA_SAMD21/LIA_SAMD21/main.c
          // Flush out and ignore the command
          scl_get_command(&scl_1);

        } else {

          /*-------------
            Not running
          ---------------
            We are ready to process any incoming commands.
          */

          str_cmd = scl_get_command(&scl_1);



          if (strcmp(str_cmd, "id?") == 0) {
            // Report identity string
            io_print("Arduino, Alia\n");



          } else if (strcmp(str_cmd, "mcu?") == 0) {
            // Report microcontroller information
            snprintf(str_buffer,
                     MAXLEN_STR_BUFFER,
                     "%s\t%s\t%lu\t%s\n",
                     FIRMWARE_VERSION,
                     MCU_MODEL,
                     VARIANT_MCK,
                     mcu_uid);
            io_print(str_buffer);



          } else if (strcmp(str_cmd, "const?") == 0) {
            // Report lock-in amplifier constants
            snprintf(str_buffer, MAXLEN_STR_BUFFER,
                     "%.6f\t%u\t%u\t%u\t%u\t%u\t%.3f\t%u\t%u\n",
                     SAMPLING_PERIOD_us,
                     BLOCK_SIZE,
                     N_BYTES_TX_BUFFER,
                     DAC_OUTPUT_BITS,
                     ADC_INPUT_BITS,
                     ADC_DIFFERENTIAL,
                     A_REF,
                     MIN_N_LUT,
                     MAX_N_LUT);
            io_print(str_buffer);



          } else if (strcmp(str_cmd, "ref?") == 0 ||
                     strcmp(str_cmd, "?") == 0) {
            // Report reference signal `ref_X` settings
            sprintf(str_buffer, "%.3f\t%.3f\t%.3f\t%s\t%i\n",
                    ref_freq, ref_offs, ref_ampl,
                    WAVEFORM_STRING[ref_waveform], N_LUT);
            io_print(str_buffer);



          } else if (strcmp(str_cmd, "lut?") == 0 ||
                     strcmp(str_cmd, "l?") == 0) {
            // Report the LUT as a binary stream. The reported LUT will start at
            // phase = 0 deg.
            io_write_blocking((uint8_t *) &N_LUT, 2);
            io_write_blocking((uint8_t *) &is_LUT_dirty, 1);
            io_write_blocking((uint8_t *) LUT_wave, N_LUT * 2);



          } else if (strcmp(str_cmd, "lut_ascii?") == 0 ||
                     strcmp(str_cmd, "la?") == 0) {
            // Report the LUT as tab-delimited ASCII. The reported LUT will start
            // at phase = 0 deg. Convenience function handy for debugging from a
            // serial console.
            uint16_t i;

            sprintf(str_buffer, "%u\t%i\n", N_LUT, is_LUT_dirty);
            io_print(str_buffer);

            for (i = 0; i < N_LUT - 1; i++) {
              sprintf(str_buffer, "%u\t", LUT_wave[i]);
              io_print(str_buffer);
            }
            sprintf(str_buffer, "%u\n", LUT_wave[N_LUT - 1]);
            io_print(str_buffer);



          } else if (strcmp(str_cmd, "t?") == 0) {
            // Report time in microseconds
            io_print_timestamp();



          } else if (strcmp(str_cmd, "off") == 0) {
            // Lock-in amp is already off and we reply with an acknowledgment
            io_print("already_off\n");



          } else if (strcmp(str_cmd, "on") == 0) {
            // Start lock-in amp
            start_LIA();



					} else if (strcmp(str_cmd, "_on") == 0) {
						// Start lock-in amp and reset the time
            __disable_irq();
            trigger_reset_time = true;
						__enable_irq();

						start_LIA();



          } else if (strncmp(str_cmd, "freq", 4) == 0) {
            // Set frequency of the reference signal [Hz].
            // Automatically recomputes the LUT and replies back the
            // effective setting.
            parse_freq(&str_cmd[4]);
            compute_LUT(LUT_wave);
            sprintf(str_buffer, "%.3f\n", ref_freq);
            io_print(str_buffer);

          } else if (strncmp(str_cmd, "_freq", 5) == 0) {
            // Set frequency of the reference signal [Hz].
            // Call 'compute_LUT(LUT_wave)' for it to become effective.
            parse_freq(&str_cmd[5]);
            is_LUT_dirty = true;
            sprintf(str_buffer, "%.3f\n", ref_freq);
            io_print(str_buffer);



          } else if (strncmp(str_cmd, "offs", 4) == 0) {
            // Set offset of the reference signal [V].
            // Automatically recomputes the LUT and replies back the
            // effective setting.
            parse_offs(&str_cmd[4]);
            compute_LUT(LUT_wave);
            sprintf(str_buffer, "%.3f\n", ref_offs);
            io_print(str_buffer);

          } else if (strncmp(str_cmd, "_offs", 5) == 0) {
            // Set offset of the reference signal [V].
            // Call 'compute_LUT(LUT_wave)' for it to become effective.
            parse_offs(&str_cmd[5]);
            is_LUT_dirty = true;
            sprintf(str_buffer, "%.3f\n", ref_offs);
            io_print(str_buffer);



          } else if (strncmp(str_cmd, "ampl", 4) == 0) {
            // Set amplitude of the reference signal [V].
            // Automatically recomputes the LUT and replies back the
            // effective setting.
            parse_ampl(&str_cmd[4]);
            compute_LUT(LUT_wave);
            sprintf(str_buffer, "%.3f\n", ref_ampl);
            io_print(str_buffer);

          } else if (strncmp(str_cmd, "_ampl", 5) == 0) {
            // Set amplitude of the reference signal [V].
            // Call 'compute_LUT(LUT_wave)' for it to become effective.
            parse_ampl(&str_cmd[5]);
            is_LUT_dirty = true;
            sprintf(str_buffer, "%.3f\n", ref_ampl);
            io_print(str_buffer);



          } else if (strncmp(str_cmd, "wave", 4) == 0) {
            // Set the waveform type of the reference signal.
            // Automatically recomputes the LUT and replies back the
            // effective setting.
            ref_waveform = atoi(&str_cmd[4]);
            ref_waveform = max(ref_waveform, 0);
            ref_waveform = min(ref_waveform, END_WAVEFORM_ENUM - 1);
            compute_LUT(LUT_wave);
            sprintf(str_buffer, "%s\n", WAVEFORM_STRING[ref_waveform]);
            io_print(str_buffer);

          } else if (strncmp(str_cmd, "_wave", 5) == 0) {
            // Set the waveform type of the reference signal.
            // Call 'compute_LUT(LUT_wave)' for it to become effective.
            ref_waveform = atoi(&str_cmd[5]);
            ref_waveform = max(ref_waveform, 0);
            ref_waveform = min(ref_waveform, END_WAVEFORM_ENUM - 1);
            is_LUT_dirty = true;
            sprintf(str_buffer, "%s\n", WAVEFORM_STRING[ref_waveform]);
            io_print(str_buffer);



          } else if (strcmp(str_cmd, "compute_lut") == 0 ||
                     strcmp(str_cmd, "c") == 0) {
            // (Re)compute the LUT based on the following known settings:
            // ref_freq, ref_offs, ref_ampl, ref_waveform.
            compute_LUT(LUT_wave);
            io_print("!\n"); // Reply with OKAY character '!'



          /* Set the waveform type of the reference signal.
             Automatically recomputes the LUT and replies back the
             effective setting. Convenience functions to be called
             from a serial terminal.
          */
          } else if (strcmp(str_cmd, "cos") == 0) {
            ref_waveform = Cosine;
            compute_LUT(LUT_wave);
            sprintf(str_buffer, "%s\n", WAVEFORM_STRING[ref_waveform]);
            io_print(str_buffer);

          } else if (strcmp(str_cmd, "sqr") == 0) {
            ref_waveform = Square;
            compute_LUT(LUT_wave);
            sprintf(str_buffer, "%s\n", WAVEFORM_STRING[ref_waveform]);
            io_print(str_buffer);

          } else if (strcmp(str_cmd, "tri") == 0) {
            ref_waveform = Triangle;
            compute_LUT(LUT_wave);
            sprintf(str_buffer, "%s\n", WAVEFORM_STRING[ref_waveform]);
            io_print(str_buffer);
          }
        }
      }
    }
  }
}
